[
  {
    "title": "President Trump pushes ahead with promise as tariffs against Mexico, Canada and China go into effect",
    "url": "https://www.foxbusiness.com/politics/trumps-tariffs-china-canada-mexico-take-effect",
    "summary": "",
    "source": "Fox News",
    "category": "headline",
    "is_headline": true,
    "content": "# President Trump pushes ahead with promise as tariffs against Mexico, Canada and China go into effect\n\n\n\nThe Claman Countdown panelists Kenny Polcari and Simeon Hyman analyze how the markets will respond to a tariff on Canada and Mexico.\n\nPresidentDonald Trump'snew tariffs on China, Canada and Mexico took effect at midnight Tuesday morning, increasing the taxes that U.S. importers will pay on certain goods when they enter the country.\n\nEffective Tuesday, U.S. imports from China, the third-largest U.S. trading partner, will be subject to a new 10% tariff on top of the initial 10% tariff he imposed on Chinese goods last month.\n\nTariffs on imported goodsfrom Canada and Mexico – America's two largest bilateral trading partners, according to Census Bureau data – are also set to rise, with 25% tariffs levied on all imports from the two countries. The tariffs include a carve-out for a lower 10% tariff on Canadian oil imports.\n\nPresident Trump was asked on Monday whether there was room left for any room left for Canada or Mexico to make a deal to avoid tariffs and he replied, \"No room left for Mexico or for Canada. No, the tariffs, you know, they're all set. They go into effect tomorrow.\"\n\nWARREN BUFFETT SAYS TARIFFS ARE AN ECONOMIC 'ACT OF WAR': 'TOOTH FAIRY DOESN'T PAY 'EM'\n\nPresident Donald Trump's 25% tariffs on Canadian and Mexican imports took effect Tuesday, as did an additional 10% tariff on Chinese goods.(Andrew Harnik/Getty Images / Getty Images)\n\nShortly after taking office in January, Trump announced he would impose tariffs on the three countries and cited the flows of illegal fentanyl shipments across the Mexican and Canadian borders, as well as precursor chemicals for fentanyl shipped from China. He cited authority under the International Emergency Economic Powers Act (IEEPA).\n\nWhile theChina tariffswere implemented on schedule, the president delayed the Canada and Mexico tariffs for a month after the two countries announced border security measures.\n\n\"Just so you understand, vast amounts of fentanyl have poured into our country from Mexico and, as you know, also from China, where it goes to Mexico and goes to Canada. And China also had an additional 10%, so it's 10 plus 10. And it comes in from Canada, and it comes in from Mexico, and that's a very important thing to say,\" Trump said during Monday's press conference.\n\nWHO GETS STUCK WITH THE BILL FOR TARIFFS ON IMPORTED CANADIAN OIL?\n\nU.S. agricultural products will face retaliatory tariffs imposed by America's trading partners.(Ben Brewer/Bloomberg via Getty Images / Getty Images)\n\nU.S. trading partners have already signaled they will retaliate through their own tariffs on American exports, as well as potential non-tariff trade barriers that would be aimed at U.S. firms.\n\nCanada announced that it will impose a 25% tariff on a wide variety of American exports, including machinery, auto parts, apparel products, alcohol and tobacco, sports equipment, plastic products, construction materials, lumber, agricultural products, appliances, furniture, chemicals and more.\n\nIt also plans additional tariffs on other U.S.-made products that are expected to includecars, trucks, buses, electric vehicles (EVs), recreational vehicles, steel and aluminum products, fruits and vegetables, beef, pork, dairy products and more.\n\nCONSUMER CONFIDENCE SLUMPS IN FEBRUARY WITH BIGGEST MONTHLY DROP IN NEARLY 4 YEARS\n\nThe U.S. auto industry is expected to face retaliatory tariffs for auto parts and potentially finished vehicles.(Photographer: Emily Elconin/Bloomberg via Getty Images / Getty Images)\n\nMexico's governmentsignaled in February that it is planning retaliatory tariffs it would implement if Trump imposed tariffs on Mexico, though it didn't specify those measures at the time. A report by Reuters citing sources familiar with the matter suggested the potential tariffs could range from 5% to 20% on U.S. pork, cheese, produce, and manufactured steel and aluminum.\n\nChina retaliated against the initial tariffs by imposing 15% tariffs onU.S. energy exports, including coal, natural gas and petroleum; as well as 10% tariffs on manufactured goods, including trucks and agricultural machinery, a Brookings Institution analysis noted.\n\nThe newly imposed tariffs are expected to elicit more retaliation from China, as the AP reported that the Chinese government is eyeing tariffs on U.S.agricultural exports and food productsas targets.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nAnanalysis by the Tax Foundationfound that the tariffs imposed on imports from China would reduce long-run GDP by 0.1%, while the tariffs on Canadian and Mexican goods would deal a bigger blow to economic output, reducing GDP by 0.3%. Those figures are before accounting for retaliation by those countries against American products.\n\nThe Tax Foundation's analysis noted that the U.S. imported $292 billion of non-energy products from Canada in 2024, as well as $120 billion in energy products. Imports from Mexico totaled $504 billion last year, while those from China totaled $430 billion plus additional imports shipped using the \"de minimis\" loophole.",
    "metadata": {
      "word_count": 797,
      "is_headline": true
    }
  },
  {
    "title": "WATCH LIVE:Unwind with commentary and comedy on ‘Gutfeld!’",
    "url": "https://www.foxnews.com/video/5614615980001",
    "summary": "",
    "source": "Fox News",
    "category": "headline",
    "is_headline": true
  },
  {
    "title": "Billionaire hedge fund manager warns of 'economic heart attack' for US economy",
    "url": "https://www.foxbusiness.com/economy/billionaire-hedge-fund-manager-warns-economic-heart-attack-us-economy",
    "summary": "",
    "source": "Fox News",
    "category": "headline",
    "is_headline": true,
    "content": "# Billionaire hedge fund manager warns of 'economic heart attack' for US economy\n\n\n\n'The Big Money Show' panel discusses the impact of Trump's agenda on American taxpayers.\n\nBridgewater Associates founder Ray Dalio said on a recent podcast that the U.S. could be headed towards a future \"economic heart attack\"without government action.\n\nHe told Bloomberg’s \"Odd Lots\" podcast that he wanted to inform policymakers that \"there’s a solution here\" that’s \"doable\" to address the government deficit and an impending debt crisis.\n\nBridgewater Associates founder Ray Dalio said on a recent podcast that the U.S. could be headed towards a future \"economic heart attack\"without government action.(Takaaki Iwabu/Bloomberg via Getty Images / Getty Images)\n\n\"You can lower that deficit to go to 3% of GDP,\" he explained to the hosts Joe Weisenthal and Tracy Alloway. \"Trump’s tax cuts come in, the projected deficit will be about 7.5% of GDP, and you have to cut that to about 3% of GDP because that’ll mean that debts won’t rise relative to incomes, and it will greatly improve the supply and demand.\"\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nThe U.S. government saw a deficit of $1.8 trillion in fiscal 2024 alone stemming from $6.75 trillion in spending while bringing in revenues of $4.92 trillion, per the Treasury Department.\n\nDalio told \"Odd Lots\" that the U.S. is \"quite near that point\" of a debt death spiral. Without action, he suggested the country could see a \"heart attack\" occur in \"three years, give or take a year, something like that.\"\n\nAmerica’s national debt currently standsat $36.2 trillion, according to the Treasury Department. It crossed the $35 trillion mark during the summer last year for the first time.\n\nNEW BUDGET PROJECTIONS SHOW US HITTING DEBT RECORD IN 4 YEARS: CBO\n\n\"If you don’t do it, you’re going to be in trouble,\" the Bridgewater Associates founder said of addressing the U.S.’s deficit and debt.\n\nThe U.S. government saw a deficit of $1.8 trillion in fiscal 2024 alone stemming from $6.75 trillion in spending while bringing in revenues of $4.92 trillion, per the Treasury Department.(SAUL LOEB/AFP via Getty Images / Getty Images)\n\nHe had gone on the Bloomberg podcast to discuss debt cycles and talk about his upcoming book \"How Countries Go Broke.\" It is slated for release in early September.\n\nDalio, whofounded Bridgewaterabout 50 years ago, has a net worth of $14 billion, according to Forbes.",
    "metadata": {
      "word_count": 399,
      "is_headline": true
    }
  }
]